package by.academy.lesson5;
//	10. »спользу€ оператор switch, написать программу, 
//  котора€ выводит на экран сообщени€ о принадлежности некоторого значени€ k
//	интервалам (-10k, 0], (0, 5], (5, 10], (10, 10k].

import java.util.Scanner;

public class StringTask10 {
	public static void main(String[] args) {
		Scanner scn = new Scanner(System.in); 
        String k = scn.next();
		
		System.out.println("Min: ");
	    scn.close();
	}

}
